name: "ensemble_ResNet",
platform: "ensemble",
max_batch_size: 0

input [
    {
        name: "bottom_image"
        data_type: TYPE_FP32
        dims: [ 1, 3, -1, -1 ]
    },
    {
        name: "side_1_image"
        data_type: TYPE_FP32
        dims: [ 1, 3, -1, -1 ]
    },
    {
        name: "side_2_image"
        data_type: TYPE_FP32
        dims: [ 1, 3, -1, -1 ]
    },
    {
        name: "side_3_image"
        data_type: TYPE_FP32
        dims: [ 1, 3, -1, -1 ]
    },
    {
        name: "side_4_image"
        data_type: TYPE_FP32
        dims: [ 1, 3, -1, -1 ]
    }
]

output [
    {
        name: "boolean_output"
        data_type: TYPE_BOOL
        dims: [ 1, 1 ]
    },
    {
        name: "probability_output"
        data_type: TYPE_FP32
        dims: [ 1, 1 ]
    }
]

ensemble_scheduling {
  step [
    {
      model_name: "ResNet_preprocessing",
      model_version: -1,
      input_map {
        key: "bottom_image",
        value: "bottom_image"
      },
      input_map {
        key: "side_1_image",
        value: "side_1_image"
      },
      input_map {
        key: "side_2_image",
        value: "side_2_image"
      },
      input_map {
        key: "side_3_image",
        value: "side_3_image"
      },
      input_map {
        key: "side_4_image",
        value: "side_4_image"
      },
      output_map {
        key: "l_x_",
        value: "l_x_"
      },
    },
    {
      model_name: "ResNet",
      model_version: -1,
      input_map {
        key: "l_x_",
        value: "l_x_"
      },
      output_map {
        key: "fc_1",
        value: "fc_1"
      }
    },
    {
      model_name: "ResNet_postprocessing",
      model_version: -1,
      input_map {
        key: "fc_1",
        value: "fc_1"
      },
      output_map {
        key: "boolean_output",
        value: "boolean_output"
      },
      output_map {
        key: "probability_output",
        value: "probability_output"
      }
    }
  ]
}