name: "ResNet_postprocessing"
backend: "python"
max_batch_size: 0

instance_group [
  {
    kind: KIND_CPU
  }
]

input [
    {
        name: "fc_1"
        data_type: TYPE_FP32
        dims: [ 1, 2 ]
    }
]

output [
    {
        name: "boolean_output"
        data_type: TYPE_BOOL
        dims: [ 1, 1 ]
    },
    {
        name: "probability_output"
        data_type: TYPE_FP32
        dims: [ 1, 1 ]
    }
]